#ifndef SORT_H_INCLUDED
#define SORT_H_INCLUDED
#include <time.h>

clock_t Select6_Vector(int *A, int n); //Алгоритм сортування №6 методу прямого вибору вектора за незменшенням.
clock_t InsertExchange_Vector(int *A, int n); //Гібридний алгоритм "вставка – обмін" для сортування вектора за незменшенням.
clock_t Select3Exchange_Vector(int *A, int n); //Гібридний алгоритм "вибір№3 – обмін" для сортування вектора за незменшенням.
clock_t Select6_Array(int ***A); //Алгоритм №6 методу прямого вибору для сортування окремо коженого перерізу тривимірного масива наскрізно по стовпчиках за незменшенням.
clock_t InsertExchange_Array(int ***A); //Гібридний алгоритм "вставка – обмін" для сортування окремо коженого перерізу тривимірного масива наскрізно по стовпчиках за незменшенням.
clock_t Select3Exchange_Array(int ***A); //Гібридний алгоритм "вибір№3 – обмін" для сортування окремо коженого перерізу тривимірного масива наскрізно по стовпчиках за незменшенням.

#endif // SORT_H_INCLUDED
